; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v6 - type_1 ?v8 - type_2)
 	      (pred_3 ?v2 - object ?v8 - type_2)
	      (pred_2 ?v6 - type_1 ?v4 - type_3)
	      (pred_1 ?v6 - type_1 ?v2 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v6 - type_1 ?v7 ?v3 - type_2)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v3)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_1 ?v1 - object ?v5 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v5) (pred_4 ?v6 ?v5) (pred_2 ?v6 ?v4))
       :effect (and (pred_1 ?v6 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v5)) 
		    (not (pred_2 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_1 ?v1 - object ?v5 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v1 ?v4) (pred_4 ?v6 ?v5))
       :effect (and (pred_3 ?v1 ?v5)
		    (pred_2 ?v6 ?v4)
		    (not (pred_1 ?v6 ?v1 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_10 - type_1
obj_06 obj_01 obj_04 obj_02 - type_3
obj_08 obj_12 obj_03 - type_2
obj_09 obj_05 obj_11 - object)
(:init
(pred_4 obj_07 obj_08)
(pred_2 obj_07 obj_06)
(pred_2 obj_07 obj_01)
(pred_4 obj_10 obj_12)
(pred_2 obj_10 obj_04)
(pred_2 obj_10 obj_02)
(pred_3 obj_09 obj_08)
(pred_3 obj_05 obj_12)
(pred_3 obj_11 obj_03)
)
(:goal
(and
(pred_3 obj_09 obj_08)
(pred_3 obj_05 obj_12)
(pred_3 obj_11 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_07 obj_03) (pred_4 obj_10 obj_03))))
  )
)
)

; plan
1. (op_3 obj_07 obj_08 obj_03)
   deleted: (pred_4 obj_07 obj_08)
   added: (pred_4 obj_07 obj_03)
   goals met: 2 of 3
2. (op_3 obj_10 obj_12 obj_08)
   deleted: (pred_4 obj_10 obj_12)
   added: (pred_4 obj_10 obj_08)
   goals met: 2 of 3
3. (op_2 obj_07 obj_11 obj_03 obj_01)
   deleted: (pred_3 obj_11 obj_03) (pred_2 obj_07 obj_01)
   added: (pred_1 obj_07 obj_11 obj_01)
   goals met: 2 of 3
4. (op_3 obj_07 obj_03 obj_08)
   deleted: (pred_4 obj_07 obj_03)
   added: (pred_4 obj_07 obj_08)
   goals met: 2 of 3
5. (op_1 obj_07 obj_11 obj_08 obj_01)
   deleted: (pred_1 obj_07 obj_11 obj_01)
   added: (pred_3 obj_11 obj_08) (pred_2 obj_07 obj_01)
   goals met: 3 of 3
